8 Задание
set1 = {}
i = 0
while i < 3:
	i = i + 1
	name = input ('Введите своё имя:')
	password = input ('Введите свой пароль:')
	set1[name] = password
print (set1)
